<template>
  <div>
    <a href="javascript:void(0)" @click="open">利用規約を読む</a>
    <el-checkbox :value="agree" :disabled="!isOpenAtLeastOnce" style="margin-left: 3rem" @change="$emit('update:agree', $event)">利用規約に同意します</el-checkbox>
    <el-dialog :visible.sync="isOpen">
      <h2>サービスのご利用にあたって</h2>
      <div class="scrollable-container">
        <h3>利用規約</h3>
        この規約 (以下「本規約」といいます。) は、株式会社HRRT (以下「当社」といいます。) が提供するリファレンスチェック及び反社チェックに関するサービス 「MiKiWaMe Point (サービスの内容又は名称が変更された場合には当該変更後のサービスを含み、以下「本サービス」といいます。) について、提供条件及び当社と契約者（第2条に定義。）の皆様との間の権利義務関係を定めるものです。本サービスの利用を希望する方は、本サービスに登録する前に、本規約ををよくお読み頂いたうえで、本規約に同意いただく必要があります。<br>
        <h4>第1条 (本規約の目的及び適用)</h4>
        1.	本規約は、当社が契約者に対し、本サービスを提供するにあたり、その基本的な契約 (以下、本規約に基づく当社と契約者との間の契約を「本契約」といいます。) の条件を明示し、当社と契約者及び本サービスの利用を希望する者（以下「契約希望者」といいます。）との間の権利義務関係を定めることを目的とします。<br>
        2.	当社が、別途書面、電子メール又は当社ウェブサイト (mikiwame-p.jp (理由の如何を問わず、当該ウェブサイトのドメイン又は内容が変更された場合は、当該変更後のドメイン等を含みます。以下も同様とします。) ) 等により随時掲載する本サービスに関する個別規定や追加規定等（以下「個別規定等」といいます。）は本規約の一部を構成するものとし、個別規定等が本規約と抵触する場合には、当該個別規定等が優先されるものとします。なお、本規約の改定又は変更については第21条で定めるものとします。<br>
        <h4>第２条（定義）</h4>
        1.	「契約者」とは、第３条に基づいて登録を完了した者をいいます。<br>
        2.	「契約希望者」とは、本サービスの利用を希望する者をいいます。<br>
        3.	「採用候補者」とは、契約者が自社の役員若しくは従業員として採用すること又は業務委託等の契約を締結することを検討している求職者等をいいます。<br>
        4.	「推薦者」とは、採用候補者が本サービスを通じて自身に関する情報提供を依頼した者をいいます。<br>
        <h4>第３条 (登録)</h4>
        1.	契約希望者は、本規約を遵守することに同意し、申込書の提出その他当社の定める方法に従い、当社の定める一定の情報（以下「登録情報」といいます。）を当社に提供することにより、本サービスにおける登録の申請をすることができます。<br>
        2.	当社は、前項の登録申請があった場合、別途当社の定める審査基準に従って審査し、当該申請を承諾する場合には、契約希望者に対してその旨の通知を行います。<br>
        3.	前項の場合、当社は、審査に必要な書類の提出を求めることがあり、契約希望者は、当該書類を速やかに提出するものとします。契約希望者が当該書類を提出しない場合その他当社の定める審査基準に適合しない場合には、当社は、契約希望者の登録申請を拒否することができるものとします。<br>
        4.	当社は、契約希望者の登録申請を承諾する場合、当該契約希望者に対し、 ユーザーID 及びパスワードを発行して、アカウントを付与するものとし、これにより登録が完了します。<br>
        5.	当社は、第3項に定めるほか、第1項に基づき登録を申請した契約希望者が、次の各号のいずれかの事由に該当する場合は、登録を拒否することがあります。<br>
        (1)	当社に提供された情報の全部又は一部につき虚偽、誤記又は記載漏れがあった場合<br>
        (2)	当該契約希望者が、本契約を締結するための法的権利又は地位を有しない場合<br>
        (3)	当該契約希望者が、本サービス利用に際して、既にアカウント削除等のサービス利用停止措置を受けた又は受けている場合<br>
        (4)	反社会的勢力等 (暴力団、暴力団員、右翼団体、反社会的勢力、その他これに準ずる者を意味し、以下も同様とします。) である、又は資金提供その他を通じて反社会的勢力等の維持、運営若しくは経営に協力若しくは関与する等反社会的勢力等との何らかの交流若しくは関与を行っている、又は過去にこれらに該当していたと当社が判断した場合<br>
        (5)	その他、当社が登録を適当でないと判断した場合<br>
        <h4>第４条 (登録情報の提供・変更)</h4>
        1.	契約希望者又は契約者は、登録情報の登録にあたっては、真実かつ正確な情報を、個人情報保護法を含む法令、規則等に違反しないように提供するものとします。また、登録情報に誤りがあった場合又は変更が生じた場合、契約希望者又は契約者は、自己の責任において、速やかに登録情報を修正又は変更するものとします。<br>
        2.	当社は、契約希望者又は契約者自身が登録した登録情報を前提として、本サービスを提供します。これらの情報の内容に虚偽、誤り、記載漏れ又は変更未了があったことにより契約希望者又は契約者に損害が生じたとしても、当社は一切責任を負いません。<br>
        3.	契約希望者又は契約者が登録情報の修正又は変更を怠ったことにより、当社からの通知が不到達となった場合、当該通知は、通常到達すべき時に到達したとみなされるものとします。<br>
        <h4>第５条 (アカウントの管理)</h4>
        1.	契約者は、自己の責任においてアカウントを管理及び保管するものとし、これを第三者に利用させ、又は貸与、譲渡、名義変更、売買等をしてはならないものとします。当社は、 ユーザーID 及びパスワードの一致を確認した場合、当該アカウントを保有する者として登録された契約者が本サービスを利用したものとみなします。<br>
        2.	アカウントの管理不十分、使用上の過誤、第三者の使用等による損害の責任は契約者が負うものとし、当社は一切の責任を負いません。<br>
        3.	契約者は、アカウントが盗用され又は第三者に使用されていることが判明した場合には、直ちにその旨を当社に通知するとともに、当社からの指示に従うものとします。<br>
        <h4>第６条 (契約者による表明保証)</h4>
        契約者は、本サービスが、契約者が採用候補者を採用し、また採用後の人材育成又は社内人事に活用するにあたり必要な情報を収集する目的で提供されることに鑑み、当社に対し、自らが採用候補者の採用を検討していること、及び本サービスを採用候補者の採用目的 (業務委託先の個人又は法人に所属する特定の個人の調査目的を含みます。) 以外に利用しないことを表明し、保証します。<br>
        <h4>第７条 (本サービスの利用)</h4>
        1.	契約者は、本契約の範囲内において、当社の定める方法に従い、本サービスを利用することができます。<br>
        2.	契約者は、本サービスを当社から提供された状態で利用するものとし、本サービスの複製、修正、変更、改変又は翻案を行うことはできません。また、利用にあたっては、当社が別途指定する条件に従うものとします。<br>
        3.	契約者は、本サービスを、直接的又は間接的にかかわらず、第三者に対する業務提供その他これに類似する用途に用いてはならないものとします。<br>
        4.	本サービスの提供を受けるために必要なコンピューター、ソフトウェアその他の機器、通信回線その他の通信環境等の準備及び維持は、契約者の費用と責任において行うものとします。<br>
        <h4>第８条 (本サービスの利用料金及び支払方法)</h4>
        1.	契約者は、当社に対して、別途当社ウェブサイト記載のとおり本サービスの利用料金を支払うものとします。なお、支払いに要する費用は契約者の負担とします。<br>
        2.	当該契約者が利用料金の支払いを遅滞した場合、当該契約者は年14.6%の割合による遅延損害金を当社に支払うものとします。<br>
        <h4>第9条 (禁止事項)</h4>
        1.	契約者は、本サービスの利用にあたり、自ら又は第三者 (契約者の関係会社、契約者の親会社の子会社や関連会社、契約者の役員又は当該役員が役員を兼任する他の会社等を含みますが、これらに限られません。) をして、次の各号のいずれかに該当する行為をし、又はさせてはなりません。また、次の各号の行為を直接又は間接に惹起し、又は容易にしてはなりません。<br>
        (1)	本契約の有効期間中及び本契約終了後1年の間、本サービスと同一又は同種の事業を行う行為<br>
        (2)	当社、採用候補者、推薦者その他の第三者に対する誹謗中傷行為<br>
        (3)	当社、採用候補者、推薦者その他の第三者に対する詐欺又は脅迫行為<br>
        (4)	当社、採用候補者、推薦者その他の第三者に対して虚偽の情報を提供する行為<br>
        (5)	本サービスを利用した採用活動の遂行途中で、合理的理由なく当該活動を放棄する行為その他採用候補者又は推薦者に対する不誠実な行為<br>
        (6)	当社、採用候補者、推薦者その他の第三者の知的財産権、肖像権、プライバシー、名誉、その他の権利若しくは利益を侵害する行為又はそのおそれのある行為<br>
        (7)	採用候補者、推薦者その他の第三者の要配慮個人情報（個人情報の保護に関する法律第2条第3項に定義されるものを意味します。）を本サービスを利用して取得する行為<br>
        (8)	本サービスの誤作動を誘引する行為<br>
        (9)	以下に該当し又は該当すると当社が判断した情報を本サービス上で伝達する行為<br>
        ①	自殺、自傷行為を誘引、勧誘又は助長する表現を含む情報<br>
        ②	薬物・危険ドラッグの売買に関する情報又は薬物・危険ドラッグの不適切な利用を助長する表現を含む情報<br>
        ③	宗教的行為、宗教団体、政治的活動、政治団体の宣伝又は広告の情報<br>
        ④	残虐な表現、性的な表現その他、他人に不快感を与えるおそれがある情報<br>
        ⑤	コンピュータウィルス等の有害なプログラムを流布させる情報<br>
        ⑥	その他当社が不適切と判断する情報<br>
        (10)	本サービス又は当社サーバー等に過度の負担をかける行為<br>
        (11)	本サービスに接続しているシステムに権限なく不正にアクセスする行為<br>
        (12)	当社又は他の契約者その他の第三者に成りすます行為<br>
        (13)	他の契約者の ユーザーID 若しくはパスワードを利用する行為又は第三者に対して自身の ユーザーID 若しくはパスワードを伝達する行為<br>
        (14)	本サービスの正常な運営を妨害する行為<br>
        (15)	反社会的勢力等となる、又は資金提供その他を通じて反社会的勢力等の維持、運営若しくは経営に協力若しくは関与する等反社会的勢力等との何らかの交流若しくは関与を行う行為<br>
        (16)	本規約のいずれかの条項に違反する行為<br>
        (17)	当社からの問合せ等の回答を求める連絡に対して30日間以上応答しない行為<br>
        (18)	その他当社が不適切と判断する行為<br>
        2.	前項第1号に違反した場合、契約者は、当社に対し、違約金として、第８条に基づく本サービスの利用料金の１年分に相当する金額又は3000万円のいずれか高い金額に相当する金額を支払うものとします。なお、当該違約金の支払いは、第15条に基づく当社の損害賠償の請求を妨げないものとします。<br>
        <h4>第10条 (登録抹消等)</h4>
        1.	当社は、契約者が前条第1項各号又は次の各号の一に該当し若しくは該当するおそれがあると当社が判断した場合、又は本サービスの運営・保守管理上必要である場合には、何らの通知も行うことなく、当社の裁量により、当該契約者に対し、契約者に関する情報の全部若しくは一部の削除、本サービスの一時停止若しくは制限又はアカウント削除等の措置 (以下「業務停止等」といいます。) を講じることができるものとします。<br>
        (1)	本契約の条項に違反し、又は違反したとの通報を受けた場合<br>
        (2)	監督官庁から営業停止又は取消等の処分等を受けた場合<br>
        (3)	当社に提供された情報の全部又は一部につき虚偽の事実があることが判明した場合<br>
        (4)	差押、仮差押、仮処分又は租税滞納処分を受けた場合<br>
        (5)	支払停止若しくは支払不能となり、又は破産手続開始若しくはこれらに類する手続の開始の申立てがあった場合<br>
        (6)	本サービスの運営、保守管理上必要である場合その他前各号に準じる事由がある場合<br>
        2.	契約者は、業務停止等を受けた後も、本契約上の一切の義務及び債務を免れるものではありません。<br>
        3.	当社は、契約者のアカウント削除後も、当該契約者が当社に提供した情報を保有・利用することができるものとします。<br>
        4.	当社は、契約者が前条第1項各号又は本条第1項各号の一に該当し又は該当するおそれがあると当社が判断した場合には、契約者に対し、違反行為の中止、送信した情報の自発的な削除・訂正等を求めることがあり、契約者は、当社が定める期間内に当該求めに応じるものとします。<br>
        5.	当社は、本条に基づき当社が行った措置により契約者に生じた不利益及び損害について、当該不利益又は損害の発生について当社に故意又は重過失がない限り、一切の責任を負いません。<br>
        <h4>第11条 (権利帰属)</h4>
        1.	本サービス及び本サービス内の当社コンテンツ (本サービスにおいて当社が契約者に対し提供する全ての情報 (文章、画像、動画、音声、音楽その他のサウンド、イメージ、ソフトウェア、プログラム、コードその他のデータを含みますが、これらに限られません。) をいいます。以下同じ。) に関する一切の知的財産権は、当社又は当社にライセンスを許諾している者に帰属します。<br>
        2.	当社は、契約者に対し、本サービスを通じて当社が提供したすべての当社コンテンツについて、本サービスを利用しての自身の採用活動又は採用候補者の採用後の人材育成若しくは社内人事に活用するために必要な範囲内における私的な利用を許諾しますが、契約者に対し、本規約上で明示する以外の権利を認めるものではありません。<br>
        3.	本サービス上、商標、ロゴ及びサービスマーク等 (以下、総称して「商標等」といいます。) が表示される場合がありますが、当社は、契約者その他の第三者に対し、商標等を譲渡し、又はその利用を許諾するものではありません。<br>
        <h4>第12条 (本契約の中途解約)</h4>
        1.	契約者及び当社は、本契約の有効期間中でも、14日前までに当社の定める方法にて相手方に通知することにより、本契約を終了することができます。なお、契約者からの通知により本契約の有効期間中に本契約を終了する場合は、本規約又は個別規定等の定めにかかわらず、契約者は、当社に対して、残存期間に対する本サービスの利用料金全額を直ちに支払うものとします。<br>
        2.	当社は、前項に基づく本契約の終了により契約者に生じた損害について一切の責任を負いません。<br>
        3.	契約者は、理由の如何にかかわらず、本契約の終了時点で本サービスを利用することができなくなります。<br>
        <h4>第13条 (本サービスの変更・中断・終了等)</h4>
        1.	当社は、契約者に事前に通知することなく、本サービスの内容の全部又は一部を変更又は追加することができるものとします。<br>
        2.	当社は、事前に、当社ウェブサイト上への掲示その他の当社が適当と判断する方法で契約者に通知することにより、当社の裁量で、本サービスの全部又は一部の提供を終了することができるものとします。ただし、緊急の場合は契約者への通知を行わない場合があります。<br>
        3.	当社は、次の各号の事由が生じた場合には、契約者に事前に通知することなく、本サービスの全部又は一部を一時的に中断することができるものとします。<br>
        (1)	本サービス用の通信機器設備等に関わるメンテナンスや修理を定期的又は緊急に行う場合<br>
        (2)	アクセス過多、その他予期せぬ要因でシステムに負荷が集中した場合<br>
        (3)	契約者のセキュリティを確保する必要が生じた場合<br>
        (4)	電気通信事業者の役務が提供されない場合<br>
        (5)	地震、水害等の天災、火災、停電、その他の不慮の事故又は戦争、紛争、動乱、暴動、労働争議等により本サービスの提供が困難な場合<br>
        (6)	法令又はこれに基づく措置により本サービスの運営が困難となった場合<br>
        (7)	その他前各号に準じ当社が必要と判断した場合<br>
        4.	当社は、本条に基づき当社が行った措置により契約者に生じた損害について当該不利益又は損害の発生について、当社に故意又は重過失がない限り、一切の責任を負いません。<br>
        <h4>第14条 (保証の否認及び免責)</h4>
        1.	当社は、リファレンスチェックに関し、全ての採用候補者について推薦者からの回答が得られること、採用候補者又は推薦者が回答した情報が正確であることについて、如何なる保証も行いません。<br>
        2.	当社は、反社チェックに関し、当社が契約者に提供する検索結果、調査結果その他の情報が正確であることについて、如何なる保証も行いません。<br>
        3.	当社は、本サービス及び本サービスを通じて提供される当社コンテンツその他一切の情報につき、契約者の特定の目的への適合性、商用的価値、正確性、有用性、完全性、適法性、契約者に適用のある団体の内部規則等への適合性、及びセキュリティ上の欠陥、エラー、バグ又は不具合が存しないこと、並びに第三者の権利を侵害しないことについて、如何なる保証も行うものではありません。<br>
        4.	当社は、本サービスがすべての情報端末に対応していることを保証するものではなく、本サービスの利用に供する情報端末の OS のバージョンアップ等に伴い、本サービスの動作に不具合が生じる可能性があることにつき、契約者は予め了承するものとします。当社は、かかる不具合が生じた場合に当社が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。<br>
        5.	本サービスに関し、契約者と第三者との間で紛争が生じた場合、契約者は、直ちにその旨を当社に通知するとともに、自己の責任と費用においてこれを解決するものとし、当社はこれに一切関与せず、何ら責任を負わないものとします。<br>
        <h4>第15条 (損害賠償)</h4>
        1.	契約者による本契約の違反行為その他本サービスの利用に起因して、当社に直接又は間接の損害が生じた場合 (当該行為が原因で、当社が第三者から損害賠償請求その他の請求を受けた場合を含みます。) 、契約者は、当社に対し、そのすべての損害 (解決金や弁護士費用、当社において対応に要した人件費相当額が含まれますが、これらに限られません。) を賠償しなければなりません。<br>
        2.	当社は、本契約の違反行為その他本サービスの利用に起因して契約者が被った損害について、当該損害の発生に関して当社に故意又は重過失がある場合にのみ責任を負うものとします。ただし、当社が負う責任は、契約者に現実に発生した直接かつ通常の損害に限り、かつ当社が本サービスの提供によって契約者から過去6ヶ月間に受領した報酬額の合計を上限とします。<br>
        <h4>第16条 (秘密保持)</h4>
        1.	当社及び契約者は、相手方の事前の書面による承諾がある場合を除き、本サービス及び本サービスに関連して相手方が開示又は提供した情報 (以下「秘密情報」といいます。)を秘密に取り扱い、第三者に開示又は提供しないものとします。ただし、相手方の書面の同意を得た場合、又は法令により第三者への開示若しくは提供を強制され、必要最小限度の範囲で開示又は提供する場合を除きます。<br>
        2.	前項にかかわらず、次の各号のいずれかに該当する情報は、前項における秘密情報から除くものとします。<br>
        (1)	開示若しくは提供の時点で既に公知のもの、又は開示若しくは提供後秘密情報を受領した受領者の責によらずして公知となったもの<br>
        (2)	受領者が第三者から秘密保持義務を負うことなく正当に入手したもの<br>
        (3)	開示又は提供の時点で受領者が既に保有しているもの<br>
        3.	契約者は、当社から開示又は提供された秘密情報の秘密を保持し、本サービスを利用した採用候補者の採用活動を行うため、又は当該採用候補者の採用後の人材育成若しくは社内人事に活用するために知る必要のある自己の役員及び従業員以外に開示又は提供してはならないものとします。<br>
        4.	当社及び契約者は、相手方から求められた場合はいつでも、相手方の指示に従い、遅滞なく、第1項の秘密情報及び当該情報を記載又は記録した書面その他の記録媒体物並びにそのすべての複製物等を返却又は廃棄しなければなりません。但し、当社は契約者に対して、契約者が採用を検討中又は採用した採用候補者に関する情報について返却又は廃棄を求めることはせず、また契約者は当社に対して、採用候補者に関する情報について返却又は廃棄を求めることはしないものとします。<br>
        5.	本条の規定は、本契約終了後も2年間効力を有するものとします。但し、前項但書きについては、本契約の有効期間中のみ効力を有するものとし、本契約終了後は第22条に基づいて処理をします。<br>
        <h4>第17条 (契約者の提供する情報の利用)</h4>
        1.	当社は、登録情報、契約者、採用候補者又は推薦者の情報、採用候補者と契約者との間の一切のコミュニケーション情報、端末情報その他本サービスの利用に関し契約者から収集する情報 (以下「会員情報等」といいます。) を、別途当社が定める個人情報取扱指針に従い、適切に取り扱います。<br>
        2.	当社は、契約者が当社に提供した情報を、当社の裁量で、本サービスの提供及び運用、サービス内容の改良及び向上、本サービスの利用状況の把握等の目的のために利用し、又は個人を特定できない形での統計的な情報として、企業に対する提案又はコンサルティング、新サービスの開発その他の目的のために利用することができるものとします。<br>
        <h4>第18条 (連絡・通知)</h4>
        1.	本規約の変更に関する通知その他本サービスに関する当社から契約者への連絡は、当社ウェブサイト内の適宜の場所への掲示、電子メールの送信その他当社が適当と判断する方法により行うものとします。<br>
        2.	本サービスに関する問い合わせその他本契約に基づく契約者から当社に対する連絡又は通知は、当社ウェブサイト内の適宜の場所に設置するお問い合わせフォームへの送信その他当社が指定する方法により行うものとします。<br>
        <h4>第19条 (権利義務の譲渡禁止)</h4>
        当社及び契約者は、相手方の書面による事前の承諾なく、本契約上の地位又は本契約に基づく権利義務の全部又は一部を、第三者に譲渡 (合併、会社分割等による包括承継を含みます。) し又は担保の目的に供することはできません。<br>
        <h4>第20条 (事業譲渡等の場合の取扱い)</h4>
        当社が本サービスにかかる事業の全部又は一部を他社に譲渡等する場合、当社は、当該事業譲渡等に伴い本契約上の地位、権利及び義務並びに会員情報等を当該事業譲渡等の譲受人に譲渡できるものとし、契約者は、かかる譲渡等につき本条において予め同意したものとみなします。本条にいう事業譲渡等には、当社が消滅会社又は分割会社となる合併又は会社分割等による包括承継を含むものとします。<br>
        <h4>第21条 (本規約の改定・変更)</h4>
        1.	当社は、当社の判断において、いつでも本規約の内容を変更又は追加できるものとします。変更後の利用規約は、当社が別途定める場合を除いて、当社ウェブサイトに掲示された時点より効力を生じるものとします。<br>
        2.	当社は、本規約を変更する場合には、当社ウェブサイトに掲載する方法その他別途当社が適切と判断する方法で、契約者に当該変更内容を公表するものとし、当該公表をもって効力が生じるものとします。当該変更内容の公表後、契約者が本サービスを利用した場合又は当社の定める期間内に何らの異議も述べなかった場合 (特段の期間を定めなかった場合には1ヶ月以内とします。) には、契約者は、本規約の変更に同意したものとみなします。<br>
        <h4>第22条 (本契約の有効期間)</h4>
        本契約の有効期間は、当社ウェブサイトで定める期間とします。ただし、契約者又は当社のいずれかから、有効期間満了の14日前までに書面又は電子メールで反対の意思が表示されない限り、本契約は同一条件 (ただし、更新前に一定のお試し期間が含まれていた場合、更新後には当該お試し期間は含まれず、当初から有料でのサービス提供とします。) で更新されるものとし、その後も同様とします。<br>
        <h4>第23条 (契約終了時の処理)</h4>
        1.	本契約が期間満了その他の理由により終了した場合、契約者は本サービスを一切利用できないものとし、当社から提供された一切の物品 (採用に至らなかった採用候補者に関する情報、本サービスの仕様書、操作マニュアル等を含みます。) を直ちに当社に返還するか又は当社の指示に従って廃棄してその旨の証明書を当社に交付するものとします。但し、契約者は、採用候補者を実際に採用した場合には、当該採用候補者に関する本サービスにより取得した情報を、本契約終了後も保持できるものとします。<br>
        2.	本契約が終了、解除又は解約された場合、契約者はその日以降は、本サービスに関連してダウンロード、コピーしたデータ、抽出した資料(媒体は問いません。契約者が採用に至らなかった採用候補者のレポートを含み、前項但書の情報を除きます。) を、法令で定められた保存のために保持する情報及び本契約の終了、解除又は解約の時点で契約者において保存することにつき合理的根拠が認められるものを除き、全て廃棄又は削除するものとします。<br>
        3.	本契約が終了、解除又は解約された場合、当社は契約者から委託を受けて保管する個人情報（契約者の採用担当者の情報や採用候補者が契約者の候補者であったこと又は契約者に雇用されたという情報を含みます。）を、法令により保存が求められる情報を除き、全て廃棄又は削除するものとします。但し、当社は、採用候補者に関する情報のうち、本サービスによって推薦者から得られた情報については廃棄又は削除せず保有を続けるものとします（契約者からのみ取得した情報は廃棄又は削除します。）。<br>
        4.	本契約が終了、解除又は解約された場合であっても、第4条第2項、第5条第2項、第9条第1項第1号及び第2項、第10条第3項及び第5項、第12条第1項第2文及び第2項、第13条第4項、第14条第4項、第15条、第16条、第17条第2項、第19条、第20条、本条並びに第24条乃至第26条は、有効に存続するものとします。<br>
        <h4>第24条 (分離可能性)</h4>
        1.	本規約のいずれかの条項又はその一部が無効又は執行不能と判断された場合であっても、当該判断は他の部分に影響を及ぼさず、本規約の残りの部分は、引き続き有効かつ執行力を有するものとします。当社及び契約者は、当該無効若しくは執行不能とされた条項又は部分の趣旨に従い、これと同等の効果を確保できるように努めるとともに修正された本規約に拘束されることに同意するものとします。<br>
        2.	本規約のいずれかの条項又はその一部が、ある契約者との関係で無効又は執行不能と判断された場合であっても、他の契約者との関係における有効性等には影響を及ぼさないものとします。<br>
        <h4>第25条 (準拠法及び合意管轄)</h4>
        本契約は日本法に準拠するものとし、本契約に起因し又は関連する一切の紛争については、その訴額に応じ、東京地方裁判所又は東京簡易裁判所を第一審の専属的合意管轄裁判所とします。<br>
        <h4>第26条 (協議解決)</h4>
        当社及び契約者は、本契約に定めのない事項又は本契約の解釈に疑義が生じた場合には、互いに信義誠実の原則に従って協議の上速やかに解決を図るものとします。<br>
        <p style="text-align: right; margin-right: 3rem">以上</p>
        <p>2020年9月1日&emsp;制定</p>
      </div>
      <div style="text-align: center">
        <el-button type="primary" @click="agreeAndClose">同意して閉じる</el-button>
      </div>
    </el-dialog>
  </div>
</template>

<script>
export default {
  name: 'PrivacyPolicyForClient',
  props: {
    agree: { type: Boolean, required: true }
  },
  data: () => ({
    isOpenAtLeastOnce: false,
    isOpen: false
  }),
  methods: {
    open() {
      this.isOpenAtLeastOnce = true
      this.isOpen = true
    },
    agreeAndClose() {
      this.isOpen = false
      this.$emit('update:agree', true)
    }
  }
}
</script>

<style lang="sass" scoped>
.scrollable-container
  height: 25rem
</style>
