<template>
  <div>
    <div class="header">
      <img src="@/assets/logo.png" class="logo">
    </div>
    <div class="container">
      <h2>プライバシーポリシー</h2>
      <p>株式会社HRRT（以下「当社」といいます。）は、当社が提供するリファレンスチェック及び反社チェックに関するサービス「MiKiWaMe Point」（サービスの内容又は名称が変更された場合には当該変更後のサービスを含み、以下「本サービス」といいます。）において取得した個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます。）を定めます。</p>
      <el-card>
        <h4>第１条（基本方針）</h4>
        1.	当社は、個⼈情報保護法その他の関係法令、個人情報保護委員会の定めるガイドライン等及び本ポリシーを遵守するとともに、組織体制を整備し、個⼈情報を適法かつ適切に取り扱います。<br>
        2.	当社は、保有する個⼈情報に関し、合理的な安全措置をとることによって、不正アクセス、漏洩等を防⽌し、適切な措置をとるよう努めます。<br>
        <h4>第２条（個人情報の利用目的）</h4>
        1.	当社は、本サービスにて取得した個人情報（個人情報保護法第２条第１項により定義された「個人情報」をいい、以下同様とします。）を以下の目的で利用します。<br>
        分類	利用目的<br>
        本サービスを利用される採用候補者様及び推薦者様の情報(Cookie情報なども含む)	・本サービスにおけるご本人確認及び不正利用防止のため<br>
        ・本サービスにおいて、採用候補者様の前職等でのご経験、評価等を収集し、求人企業に提供するため<br>
        ・求人企業において候補者様の採用、採用後の人材育成又は社内人事に活用するため<br>
        本サービスに関する利用規約の変更、本ポリシーの変更、当該サービスの停止・中止・契約解除その他当該サービスに関する重要なお知らせ等の通知のため<br>
        契約者担当者様情報	・本サービスに関する契約締結確認等のため<br>
        ・お問い合わせへの対応・連絡、及び当社からの情報提供のため<br>
        ・本サービスに関する利用規約の変更、本規程の変更、本サービスの停止・中止・契約解除その他本サービスに関する重要なお知らせ等の通知のため<br>
        <br>
        2.	前項に定める以外の目的で、当社が書面その他の方法によって個人情報を取得する場合、当社は、その取得に先立って、ご本人に対し利用目的を明示するものとします。<br>
        3.	当社は、第１項の利用目的を、変更前の利用目的と相当の関連性を有すると合理的に認められる範囲内において変更することがあり、変更した場合には、当社が別途定める方法により、通知又は公表します。<br>
        <h4>第３条（利用目的の変更）</h4>
        1.	当社は、利用目的が変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。<br>
        2.	利用目的の変更を行った場合には、変更後の目的について、当社所定の方法により、通知、または当社ウェブサイト上に公表するものとします。<br>
        <h4>第４条（個人情報の取扱いの委託）</h4>
        当社は、取得した個人情報の全部又は一部の取扱いを第三者に委託（個人情報を含む情報の分析、管理その他の業務を事業者に委託する場合などをいいます。）することがあります。この場合、当社は、当該委託先との間で秘密保持契約等をあらかじめ締結するとともに、当該委託先において情報の適切な安全管理が図られるよう、必要かつ適切な監督を行います。<br>
        <h4>第５条（第三者提供）</h4>
        当社は、次に掲げる場合を除いて、あらかじめご本人の同意を得ることなく、第三者に個人情報を提供することはありません。ただし、個人情報保護法その他の法令で認められる場合を除きます。<br>
        (1)	人の生命、身体または財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき<br>
        (2)	公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき<br>
        (3)	国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき<br>
        (4)	予め次の事項を告知あるいは公表し、かつ当社が個人情報保護委員会に届出をしたとき<br>
        ①	利用目的に第三者への提供を含むこと<br>
        ②	第三者に提供されるデータの項目<br>
        ③	第三者への提供の手段または方法<br>
        ④	本人の求めに応じて個人情報の第三者への提供を停止すること<br>
        ⑤	本人の求めを受け付ける方法<br>
        (5)	前項の定めにかかわらず、次に掲げる場合には、当該情報の提供先は第三者に該当しないものとします。<br>
        ⑥	当社が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合<br>
        ⑦	合併その他の事由による事業の承継に伴って個人情報が提供される場合<br>
        ⑧	個人情報を特定の者との間で共同して利用する場合であって、その旨並びに共同して利用される個人情報の項目、共同して利用する者の範囲、利用する者の利用目的および当該個人情報の管理について責任を有する者の氏名または名称について、あらかじめ本人に通知し、または本人が容易に知り得る状態に置いた場合<br>
        <h4>第６条（安全管理措置）</h4>
        当社は、個人情報を利用目的の範囲内で正確・完全・最新の内容に保つよう努め、不正なアクセス、漏えい、改ざん、滅失、き損等を防止するため、現時点での技術水準に合わせた必要かつ適切な安全管理措置を講じ、必要に応じて是正してまいります。<br>
        <h4>第７条（開示、訂正、利用停止等の請求）</h4>
        1.	当社は、保有する個⼈情報について、個⼈情報保護法に基づく開⽰、訂正・追加・削除、利⽤停⽌・消去等（以下、「開示等」といいます。）の請求があった場合、請求された⽅が本⼈であることを確認した後、個⼈情報保護法に従って対応いたします。<br>
        2.	前項にかかわらず、開示等に多額の費用を有する場合その他開示等を行うことが困難な場合であって、ご本人の権利利益を保護するために必要なこれに代わるべき措置をとれる場合は、この代替策を講じるものとします。<br>
        <h4>第８条（お問い合わせ窓口）</h4>
        ご意見、ご質問、苦情のお申出その他個人情報の取扱いに関するお問い合わせは、下記の窓口までお願いいたします。<br>
        <div class="address">
          住所：東京都港区南青山3丁目8番40号青山センタービル2F<br>
          株式会社HRRT<br>
          個人情報取扱責任者：五味渕久昭<br>
          連絡先：03-5324-2351<br>
        </div>
        <h4>第９条（プライバシーポリシーの変更手続）</h4>
        当社は、必要に応じて本ポリシーを変更します。但し、法令上ご本人の同意が必要となるような本ポリシーの変更を行う場合、変更後の本ポリシーは、当社所定の方法で変更に同意した方に対してのみ適用されるものとします。なお、当社、本ポリシーを変更する場合には、変更後の本ポリシーを当社ウェブサイト上での表示その他の適切な方法により周知します。<br>
        <br>
        2020年9月1日&emsp;制定
      </el-card>
    </div>
  </div>
</template>

<script>
export default {
  name: 'PrivacyPolicy'
}
</script>

<style lang="sass" scoped>
@import '@/styles/variables.scss'

$header-height: 64px
.header, .logo
  height: $header-height
.header
  width: 100vw
  position: fixed
  top: 0
  background-color: $backgroundPrimary
  box-shadow: 0px 2px 5px 0 grey
.logo
  background-color: #fff

.container
  margin-top: calc(#{$header-height} + 1rem)
.address
  padding: 2rem

</style>

